In [1]:
import numpy as np
import pandas as pd

In [2]:
print(pd.__version__)

1.0.3

In [2]:
data = np.random.randint(1, 100, (3,4))

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    0   1   2   3
0  44  85  52  30
1  29  99  97  44
2  17  70  45  36

In [5]:
df = pd.DataFrame(data, columns=list('ABCD'), index=list('XYZ'))

In [6]:
df

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44
Z  17  70  45  36

In [7]:
list('ABCD')

['A', 'B', 'C', 'D']

In [8]:
df = pd.DataFrame(data, index=list('XYZ'), columns=list('ABCD'))

In [9]:
df

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44
Z  17  70  45  36

In [10]:
df['A']

X    44
Y    29
Z    17
Name: A, dtype: int32

In [11]:
df['X':'Y']

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44

In [12]:
df[0:1]

    A   B   C   D
X  44  85  52  30

In [13]:
df.loc['X':'Y']

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44

In [14]:
df.iloc[0:2]

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44

In [15]:
df.loc['X']

A    44
B    85
C    52
D    30
Name: X, dtype: int32

In [16]:
df.iloc[0]

A    44
B    85
C    52
D    30
Name: X, dtype: int32

In [17]:
df

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44
Z  17  70  45  36

In [18]:
df.loc['X', 'A']   # [row, column]

44

In [19]:
df.iloc[0,0]   # [row, column]

44

In [20]:
df.loc[('X','Y'),'A']    # [(row,row), column]

X    44
Y    29
Name: A, dtype: int32

In [21]:
df.loc[('X','Y'), ('A','B')]     # [(row,row), (column, column)]

    A   B
X  44  85
Y  29  99

In [22]:
df>10

      A     B     C     D
X  True  True  True  True
Y  True  True  True  True
Z  True  True  True  True

In [23]:
df[df>10]

    A   B   C   D
X  44  85  52  30
Y  29  99  97  44
Z  17  70  45  36

In [24]:
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]

In [25]:
index = pd.MultiIndex.from_tuples(index)

In [26]:
populations = [1234,5678,4321,2636, 9928, 3532]

In [27]:
pop = pd.Series(populations, index=index)

In [28]:
pop

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

In [29]:
pop['Texas']

2000    9928
2010    3532
dtype: int64

In [30]:
pop['California':'Texas']

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

In [31]:
pop[['California', 'Texas']]

California  2000    1234
            2010    5678
Texas       2000    9928
            2010    3532
dtype: int64

In [32]:
pop['California', 2000]

1234

In [33]:
pop[:, 2010]

California    5678
New York      2636
Texas         3532
dtype: int64

In [34]:
pop.loc['California', 2000]

1234

In [35]:
pop.loc[['California', 'Texas'], 2000]

California  2000    1234
Texas       2000    9928
dtype: int64

In [42]:
pop.loc[['California':'Texas'], 2000] # this will give error

SyntaxError: invalid syntax (<ipython-input-42-6d5025402910>, line 1)

In [43]:
pop.loc['California':'Texas']

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

In [44]:
pop.loc[['California':'Texas']] # this will give error

SyntaxError: invalid syntax (<ipython-input-44-fb39595a1549>, line 1)

In [45]:
pop.loc[slice('California', 'Texas')]

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

In [47]:
pop.loc[slice('California', 'Texas'), slice(None)]

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

In [48]:
pop.loc[slice('California', 'Texas'), slice(2000)]

California  2000    1234
New York    2000    4321
Texas       2000    9928
dtype: int64

In [49]:
pop.loc[slice('New York'), slice(None)]

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
dtype: int64

In [50]:
pop

California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

In [51]:
pop.index.names=['Place','Year']

In [52]:
pop

Place       Year
California  2000    1234
            2010    5678
New York    2000    4321
            2010    2636
Texas       2000    9928
            2010    3532
dtype: int64

#### Multi-indexing

In [3]:
mindex = pd.MultiIndex.from_product(
                                        [[2013,2014],[1,2]],
                                        names = ['Year', 'Visit']
                                    )

In [4]:
mcolumn = pd.MultiIndex.from_product(
                                        [['Sue','Bob','John'],['Heart Rate', 'Temperature']],
                                        names = ['Name','Parameter']
                                    )

In [5]:
data = np.random.randint(44, 92, size=(4,6))

In [6]:
df = pd.DataFrame( data, columns = mcolumn, index = mindex)

In [7]:
df # This is 4-dimensional data

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2013 1             91          60         84          77         54
     2             54          91         90          74         77
2014 1             87          85         46          88         62
     2             91          78         91          49         70

Name
Parameter  Temperature
Year Visit
2013 1              79
     2              45
2014 1              81
     2              65

In [8]:
df['Bob']

Parameter   Heart Rate  Temperature
Year Visit
2013 1              84           77
     2              90           74
2014 1              46           88
     2              91           49

In [59]:
df.loc[:,'Bob']

Parameter   Heart Rate  Temperature
Year Visit
2013 1              53           83
     2              52           54
2014 1              56           64
     2              80           79

In [60]:
df['Bob','Temperature']

Year  Visit
2013  1        83
      2        54
2014  1        64
      2        79
Name: (Bob, Temperature), dtype: int32

In [61]:
df.loc[:,:]

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2013 1             53          50         53          83         62
     2             77          62         52          54         76
2014 1             80          44         56          64         54
     2             84          60         80          79         88

Name
Parameter  Temperature
Year Visit
2013 1              67
     2              56
2014 1              90
     2              90

In [62]:
df.loc[(2013,1), ('Sue')] # this is giving correct result

Parameter
Heart Rate     53
Temperature    50
Name: (2013, 1), dtype: int32

In [63]:
df.loc[[2013,1],['Sue']] # this is giving incorrect result

Name              Sue
Parameter  Heart Rate Temperature
Year Visit
2013 1             53          50
     2             77          62

In [64]:
df.loc[(2013,1)] # correct result

Name  Parameter
Sue   Heart Rate     53
      Temperature    50
Bob   Heart Rate     53
      Temperature    83
John  Heart Rate     62
      Temperature    67
Name: (2013, 1), dtype: int32

In [65]:
df.loc[[2013,1]] # incorrect result

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2013 1             53          50         53          83         62
     2             77          62         52          54         76

Name
Parameter  Temperature
Year Visit
2013 1              67
     2              56

In [66]:
df.loc[:, ('Sue','Heart Rate')]

Year  Visit
2013  1        53
      2        77
2014  1        80
      2        84
Name: (Sue, Heart Rate), dtype: int32

In [10]:
idx = pd.IndexSlice

In [68]:
df.loc[ idx[:,2], idx['John',:]]

Name             John
Parameter  Heart Rate Temperature
Year Visit
2013 2             76          56
2014 2             88          90

In [69]:
df.loc[ idx[2013, 1], idx['John','Temperature'] ]

67

In [70]:
df.loc[ idx[:,:], idx[:,'Heart Rate'] ]

Name              Sue        Bob       John
Parameter  Heart Rate Heart Rate Heart Rate
Year Visit
2013 1             53         53         62
     2             77         52         76
2014 1             80         56         54
     2             84         80         88

In [71]:
df.loc[ idx[2013,:], idx['Bob',:] ]

Name              Bob
Parameter  Heart Rate Temperature
Year Visit
2013 1             53          83
     2             52          54

In [72]:
df.loc[idx[2014,:], idx[:,:]]

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2014 1             80          44         56          64         54
     2             84          60         80          79         88

Name
Parameter  Temperature
Year Visit
2014 1              90
     2              90

In [78]:
df.loc[ idx[2014,:], idx['Bob','Temperature'] ]

Year  Visit
2014  1        64
      2        79
Name: (Bob, Temperature), dtype: int32

In [74]:
df.sort_index(axis=1).loc[ idx[2013, 2], idx['Bob':'Guido', 'Heart Rate'] ]

Name  Parameter
Bob   Heart Rate    52
Name: (2013, 2), dtype: int32

In [80]:
df.loc[ idx[2013, 2], idx['Bob', 'Heart Rate']  ]

52

In [11]:
df.loc[ idx[2013, 2], idx['Bob':'Guido', 'Heart Rate']  ]

UnsortedIndexError: 'MultiIndex slicing requires the index to be lexsorted: slicing on levels [0], lexsort depth 0'

In [82]:
df.loc[ idx[:, 2], idx[:, :]  ]

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2013 2             77          62         52          54         76
2014 2             84          60         80          79         88

Name
Parameter  Temperature
Year Visit
2013 2              56
2014 2              90

In [83]:
df.loc[ idx[:, 1:2], idx[:, :]  ]

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2013 1             53          50         53          83         62
     2             77          62         52          54         76
2014 1             80          44         56          64         54
     2             84          60         80          79         88

Name
Parameter  Temperature
Year Visit
2013 1              67
     2              56
2014 1              90
     2              90

In [84]:
df.loc[idx[2014,:], idx[:,:]]

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2014 1             80          44         56          64         54
     2             84          60         80          79         88

Name
Parameter  Temperature
Year Visit
2014 1              90
     2              90

In [87]:
df.loc[idx[2014,:], idx['Bob',:] ]

Name              Bob
Parameter  Heart Rate Temperature
Year Visit
2014 1             56          64
     2             80          79

#### Data aggregation

In [12]:
df

Name              Sue                    Bob                   John  \
Parameter  Heart Rate Temperature Heart Rate Temperature Heart Rate
Year Visit
2013 1             91          60         84          77         54
     2             54          91         90          74         77
2014 1             87          85         46          88         62
     2             91          78         91          49         70

Name
Parameter  Temperature
Year Visit
2013 1              79
     2              45
2014 1              81
     2              65

In [13]:
df.mean(level='Year')

Name             Sue                    Bob                   John
Parameter Heart Rate Temperature Heart Rate Temperature Heart Rate Temperature
Year
2013            72.5        75.5       87.0        75.5       65.5        62.0
2014            89.0        81.5       68.5        68.5       66.0        73.0

In [15]:
df.mean(level='Visit')

Name             Sue                    Bob                   John
Parameter Heart Rate Temperature Heart Rate Temperature Heart Rate Temperature
Visit
1               89.0        72.5       65.0        82.5       58.0        80.0
2               72.5        84.5       90.5        61.5       73.5        55.0

In [16]:
df.mean(axis=1, level='Name')

Name         Sue   Bob  John
Year Visit
2013 1      75.5  80.5  66.5
     2      72.5  82.0  61.0
2014 1      86.0  67.0  71.5
     2      84.5  70.0  67.5

In [17]:
df.mean(axis=1, level='Parameter')

Parameter   Heart Rate  Temperature
Year Visit
2013 1       76.333333    72.000000
     2       73.666667    70.000000
2014 1       65.000000    84.666667
     2       84.000000    64.000000

#### Analysis using US States

##### Task is to rank US states and territories by their 2010 population density

In [19]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

print(pop.head())
print(areas.head())
print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [23]:
merged = pd.merge(pop, abbrevs, left_on='state/region', right_on='abbreviation', how='outer')

merged.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [24]:
merged = merged.drop('abbreviation', axis=1)

In [25]:
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [26]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [27]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [29]:
merged[merged['state'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [33]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [34]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'

merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'

merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [35]:
print(merged.head())
print(areas.head())

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [37]:
final = pd.merge(merged, areas, on='state', how='left')

final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [38]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [39]:
final[final['area (sq. mi)'].isnull()].head()

     state/region     ages  year   population          state  area (sq. mi)
2496          USA  under18  1990   64218512.0  United States            NaN
2497          USA    total  1990  249622814.0  United States            NaN
2498          USA    total  1991  252980942.0  United States            NaN
2499          USA  under18  1991   65313018.0  United States            NaN
2500          USA  under18  1992   66509177.0  United States            NaN

In [41]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [44]:
final.dropna(inplace= True)

final.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)    False
dtype: bool

In [45]:
data2010 = final.query("year==2010 & ages=='total'")

In [46]:
type(data2010)

pandas.core.frame.DataFrame

In [47]:
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [48]:
data2010.set_index('state', inplace = True)

data2010.head()

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

In [49]:
data2010['density'] = data2010['population'] / data2010['area (sq. mi)']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [50]:
data2010.head()

           state/region   ages  year  population  area (sq. mi)     density
state
Alabama              AL  total  2010   4785570.0        52423.0   91.287603
Alaska               AK  total  2010    713868.0       656425.0    1.087509
Arizona              AZ  total  2010   6408790.0       114006.0   56.214497
Arkansas             AR  total  2010   2922280.0        53182.0   54.948667
California           CA  total  2010  37333601.0       163707.0  228.051342

In [51]:
data2010.sort_values(by=['density'], ascending=False, inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [52]:
data2010.head()

,state/region,ages,year,population,area (sq. mi),density
state,,,,,,
District of Columbia,DC,total,2010,605125.0,68.0,8898.897059
Puerto Rico,PR,total,2010,3721208.0,3515.0,1058.665149
New Jersey,NJ,total,2010,8802707.0,8722.0,1009.253268
Rhode Island,RI,total,2010,1052669.0,1545.0,681.339159
Connecticut,CT,total,2010,3579210.0,5544.0,645.600649

In [53]:
data2010.tail()

             state/region   ages  year  population  area (sq. mi)    density
state
South Dakota           SD  total  2010    816211.0        77121.0  10.583512
North Dakota           ND  total  2010    674344.0        70704.0   9.537565
Montana                MT  total  2010    990527.0       147046.0   6.736171
Wyoming                WY  total  2010    564222.0        97818.0   5.768079
Alaska                 AK  total  2010    713868.0       656425.0   1.087509

#### Grouping

In [54]:
import seaborn as sns

planets = sns.load_dataset('planets') # planets data is in-built in the Seaborn package

In [55]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [58]:
planets.groupby('method').count()

                               number  orbital_period  mass  distance  year
method
Astrometry                          2               2     0         2     2
Eclipse Timing Variations           9               9     2         4     9
Imaging                            38              12     0        32    38
Microlensing                       23               7     0        10    23
Orbital Brightness Modulation       3               3     0         2     3
Pulsar Timing                       5               5     0         1     5
Pulsation Timing Variations         1               1     0         0     1
Radial Velocity                   553             553   510       530   553
Transit                           397             397     1       224   397
Transit Timing Variations           4               3     0         3     4

In [59]:
planets.groupby('year').count()

      method  number  orbital_period  mass  distance
year
1989       1       1               1     1         1
1992       2       2               2     0         0
1994       1       1               1     0         0
1995       1       1               1     1         1
1996       6       6               6     4         6
1997       1       1               1     1         1
1998       5       5               5     5         5
1999      15      15              15    14        15
2000      16      16              16    14        16
2001      12      12              12    11        12
2002      32      32              32    31        31
2003      25      25              25    22        24
2004      26      26              22    15        23
2005      39      39              38    34        37
2006      31      31              28    20        28
2007      53      53              52    32        45
2008      74      74              69    43        64
2009      98      98              96    74        83
2010     102     102              96    41        93
2011     185     185             184    91       155
2012     140     140             132    24        91
2013     118     118             107    30        71
2014      52      52              51     5         6

In [61]:
planets.sort_values('year', ascending=True).head()

              method  number  orbital_period    mass  distance  year
441  Radial Velocity       1       83.888000  11.680     40.57  1989
942    Pulsar Timing       3       66.541900     NaN       NaN  1992
941    Pulsar Timing       3       25.262000     NaN       NaN  1992
943    Pulsar Timing       3       98.211400     NaN       NaN  1994
16   Radial Velocity       1        4.230785   0.472     15.36  1995

In [62]:
planets.groupby('year').aggregate([max]) # returns max for each column after grouping data by 'year'

                         method number orbital_period    mass distance
                            max    max            max     max      max
year
1989            Radial Velocity      1      83.888000  11.680    40.57
1992              Pulsar Timing      3      66.541900     NaN      NaN
1994              Pulsar Timing      3      98.211400     NaN      NaN
1995            Radial Velocity      1       4.230785   0.472    15.36
1996            Radial Velocity      5    1078.000000   3.900    21.41
1997            Radial Velocity      1      39.845000   1.040    17.43
1998            Radial Velocity      4     442.100000   8.020    47.92
1999            Radial Velocity      4    3810.000000   8.440    59.03
2000            Radial Velocity      4    2502.000000  18.100    80.00
2001            Radial Velocity      3    2391.000000  10.350    77.82
2002                    Transit      5    4909.000000  17.400   121.36
2003            Radial Velocity      3   36525.000000  18.370   133.16
2004                    Transit      5    4205.800000   3.690  2500.00
2005            Radial Velocity      4    4270.000000  14.000   300.30
2006                    Transit      4  730000.000000   7.600  8500.00
2007                    Transit      5    1333.000000  19.800  2000.00
2008                    Transit      6  318280.000000  25.000   680.00
2009                    Transit      3   17337.500000  21.420   550.00
2010                    Transit      6   18000.000000  13.000  2700.00
2011  Transit Timing Variations      6   40000.000000  13.650  2250.00
2012  Transit Timing Variations      6    6005.000000  11.100  7720.00
2013  Transit Timing Variations      7    4100.000000  20.600  7560.00
2014  Transit Timing Variations      5    3827.000000   2.580  1056.00

In [71]:
planets.groupby(['year','method']).size() # grouping by multiple columns

year  method
1989  Radial Velocity               1
1992  Pulsar Timing                 2
1994  Pulsar Timing                 1
1995  Radial Velocity               1
1996  Radial Velocity               6
                                   ..
2013  Transit                      75
      Transit Timing Variations     1
2014  Radial Velocity              11
      Transit                      40
      Transit Timing Variations     1
Length: 69, dtype: int64

#### Titanic

In [72]:
titanic = sns.load_dataset('titanic')

titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [73]:
titanic.groupby(['sex'])['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [76]:
titanic.groupby(['sex', 'class'])['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [77]:
titanic.groupby(['alone'])['survived'].mean()

alone
False    0.505650
True     0.303538
Name: survived, dtype: float64

In [79]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='mean')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [80]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='sum')

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

In [81]:
titanic.pivot_table('survived', index=['sex','alone'], columns='class', aggfunc='mean')

class            First    Second     Third
sex    alone
female False  0.966667  0.931818  0.416667
       True   0.970588  0.906250  0.616667
male   False  0.425532  0.277778  0.180723
       True   0.333333  0.097222  0.121212

In [82]:
# applying different aggfunc to different columns

titanic.pivot_table(index='sex', columns='class', aggfunc={'survived': sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

#### U.S. birth data

In [83]:
births = pd.read_csv('births.csv')

births.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [84]:
births.info

<bound method DataFrame.info of        year  month  day gender  births
0      1969      1  1.0      F    4046
1      1969      1  1.0      M    4440
2      1969      1  2.0      F    4454
3      1969      1  2.0      M    4548
4      1969      1  3.0      F    4548
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[15547 rows x 5 columns]>

In [85]:
births['decade'] = (births['year'] // 10) * 10

In [86]:
births.head()

   year  month  day gender  births  decade
0  1969      1  1.0      F    4046    1960
1  1969      1  1.0      M    4440    1960
2  1969      1  2.0      F    4454    1960
3  1969      1  2.0      M    4548    1960
4  1969      1  3.0      F    4548    1960

In [87]:
births.pivot_table('births', index='decade', columns='gender', aggfunc='sum')

gender         F         M
decade
1960     1753634   1846572
1970    16263075  17121550
1980    18310351  19243452
1990    19479454  20420553
2000    18229309  19106428